# Homework 1

In this homework set, we will practice using pandas to clean and prep our data. 

### Deliverables: 
1. Pandas notebook with outputs
2. The `acs_nyc.csv` file you used
3. (Optional) The chatgpt output as a csv.

In [1]:
# We are going to start importing the libraries we need
# all in one cell. 

# It is a good practice to keep all the imports in one cell so that
# we can easily see what libraries we are using in the notebook.
import pandas as pd

## There is no need to import libraries more than once!

c:\Users\desai\miniforge3\envs\crp4680\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.7.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

# Household Income and Home Value in NYC
In this exercise, you are going to investigate the relationship between household income and home values in New York City. 

You are given the dataset `acs_nyc.csv`, which was extracted from the IPUMS NHGIS portal.

# Data Loading and Initial Exploration

In [2]:
acs_nyc = pd.read_csv('acs_nyc.csv')

Display the first 12 rows of the data. (1 pt)

In [4]:
acs_nyc.head(12)

           FIPS  hh_income  house_value
0   36005000100        NaN          NaN
1   36005000200    70867.0     457300.0
2   36005000400    98090.0     456100.0
3   36005001600    40033.0     587600.0
4   36005001901    55924.0          NaN
5   36005001902    60804.0     425600.0
6   36005001903        NaN          NaN
7   36005001904        NaN          NaN
8   36005002001    20870.0          NaN
9   36005002002        NaN     441800.0
10  36005002300    22177.0          NaN
11  36005002400        NaN          NaN

How many rows and how many columns are in the data? (1pt)

In [11]:
rows, columns = acs_nyc.shape

print(f"there are {rows} rows and {columns} columns")

there are 2327 rows and 3 columns

What are the datatypes for each column? (1pt)

FIPS has type int64, and hh_income and house_value have type float64.

In [13]:
acs_nyc.dtypes

FIPS             int64
hh_income      float64
house_value    float64
dtype: object

Using one function, display the 25th, 50th, 75th percentiles, mean, min, max, count, and standard deviations for the `hh_income` and `house_value` columns. (1 pt)

In [23]:
acs_nyc[["hh_income", "house_value"]].describe()

           hh_income   house_value
count    2196.000000  1.966000e+03
mean    78730.628871  7.599776e+05
std     38669.599532  3.642487e+05
min     11988.000000  9.999000e+03
25%     53277.250000  5.306750e+05
50%     73199.500000  6.646000e+05
75%     96989.000000  9.087250e+05
max    250001.000000  2.000001e+06

# Data Manipulation
The FIPS code is a unique identifier for each administrative unit in the US. This is how to read a FIPS code. The number of digits in your `FIPS` columns corresponds to whether each row is a state, county, tract, or block. 

![This is how to read a FIPS code](https://customer.precisely.com/servlet/rtaImage?eid=ka0Vu0000000qGs&feoid=00N6g00000TynF6&refid=0EM6g0000010wuS)

1. What administrative unit is our dataset, based on how many FIPS digits in the `FIPS` column? (1 pt)

You can write your answer in this cell.

##ANSWER<br>
There are 11 digits for each entry in the FIPS column, which means that the administrative unit is **tracts**.

2. Using the FIPS code, create the following columns: (5 pts)
- State
- County: 
    - Bronx County: 36005
    - Brooklyn County: 36047
    - Manhattan County: 36061
    - Queens County: 36081
    - Staten Island: 36085
- Tract_ID

In [25]:
## INSERT YOUR CODE HERE

int(str(36005000400)[:2])
int(str(36005000400)[2:5])

5

3. Check for null values in the `hh_income` and `house_value` columns. Remove any rows with both hh_income and house_value missing. With the rest of the missing values, replace missing values in these columns with the mean value of their respective columns. (5 pts)

In [31]:
## first I apply a mask that takes out rows where both columns are null
acs_nyc=acs_nyc[~(acs_nyc['hh_income'].isna() & acs_nyc['house_value'].isna())]

##replace missing income with mean

##replace missing

             FIPS  hh_income  house_value
1     36005000200    70867.0     457300.0
2     36005000400    98090.0     456100.0
3     36005001600    40033.0     587600.0
4     36005001901    55924.0          NaN
5     36005001902    60804.0     425600.0
...           ...        ...          ...
2321  36085030301    95913.0     457600.0
2322  36085030302    85842.0     420500.0
2323  36085031901        NaN     288300.0
2324  36085031902    76066.0     381600.0
2325  36085032300    86471.0     237100.0

[2212 rows x 3 columns]

Verify that there are no more null values in these columns. (1 pt)

In [ ]:
## INSERT YOUR CODE HERE

# Data analysis

Group the data by `County` and find the median household income and house value. Which county has the lowest median house income and house value? Show this through sorting the dataframe's rows by lowest median household income to highest and only displaying the first row. (5pt)

In [ ]:
## INSERT YOUR CODE HERE

Which county has largest standard deviation in house income and house value? Show this through sorting the dataframe's rows by highest household income variance to lowest and only displaying the first row.(5pt)

In [ ]:
## INSERT YOUR CODE HERE

# Bonus (3 pts)
Take our original `acs_nyc.csv` and ask Chatgpt to clean it. What was the prompt that you gave it? Attach the dataset that it returned as a csv and read it into the cell below.

INSERT YOUR PROMPT HERE.

In [ ]:
## INSERT YOUR CODE HERE